FK Load Test Plan.jmx

<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.4" jmeter="2.9 r1437961">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <stringProp name="TestPlan.comments"></stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">http://localhost:8080/inera-certificate</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath"></stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="FK Mina Sidor" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1000</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1370853521000</longProp>
        <longProp name="ThreadGroup.end_time">1370853521000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration"></stringProp>
        <stringProp name="ThreadGroup.delay"></stringProp>
      </ThreadGroup>
      <hashTree>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="ListCertificates" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.URL_DATA">${HOST}/list-certificates/v1.0</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soap:Header&gt;&lt;ns4:To xmlns:ns4=&quot;http://www.w3.org/2005/08/addressing&quot; xmlns:ns3=&quot;urn:riv:insuranceprocess:healthreporting:2&quot; xmlns:ns2=&quot;urn:riv:insuranceprocess:certificate:1&quot; xmlns=&quot;urn:riv:insuranceprocess:healthreporting:ListCertificatesResponder:1&quot;/&gt;&lt;/soap:Header&gt;&lt;soap:Body&gt;&lt;ListCertificatesRequest xmlns=&quot;urn:riv:insuranceprocess:healthreporting:ListCertificatesResponder:1&quot; xmlns:ns2=&quot;urn:riv:insuranceprocess:certificate:1&quot; xmlns:ns3=&quot;urn:riv:insuranceprocess:healthreporting:2&quot; xmlns:ns4=&quot;http://www.w3.org/2005/08/addressing&quot;&gt;&lt;nationalIdentityNumber&gt;19121212-1212&lt;/nationalIdentityNumber&gt;&lt;certificateType&gt;FK7263&lt;/certificateType&gt;&lt;fromDate&gt;2013-04-01&lt;/fromDate&gt;&lt;toDate&gt;2013-04-30&lt;/toDate&gt;&lt;/ListCertificatesRequest&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.xml_data_file"></stringProp>
          <stringProp name="SoapSampler.SOAP_ACTION">urn:riv:insuranceprocess:healthreporting:ListCertificatesResponder:1:ListCertificates</stringProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">true</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
        </SoapSampler>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="GetCertificate-1" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.URL_DATA">${HOST}/get-certificate/v1.0</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soap:Header&gt;&lt;ns4:To xmlns:ns4=&quot;http://www.w3.org/2005/08/addressing&quot; xmlns:ns3=&quot;urn:riv:insuranceprocess:healthreporting:2&quot; xmlns:ns2=&quot;urn:riv:insuranceprocess:certificate:1&quot; xmlns=&quot;urn:riv:insuranceprocess:healthreporting:GetCertificateResponder:1&quot;/&gt;&lt;/soap:Header&gt;&lt;soap:Body&gt;&lt;GetCertificateRequest xmlns=&quot;urn:riv:insuranceprocess:healthreporting:GetCertificateResponder:1&quot; xmlns:ns2=&quot;urn:riv:insuranceprocess:certificate:1&quot; xmlns:ns3=&quot;urn:riv:insuranceprocess:healthreporting:2&quot; xmlns:ns4=&quot;http://www.w3.org/2005/08/addressing&quot;&gt;&lt;certificateId&gt;intyg-1&lt;/certificateId&gt;&lt;nationalIdentityNumber&gt;19121212-1212&lt;/nationalIdentityNumber&gt;&lt;/GetCertificateRequest&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.xml_data_file"></stringProp>
          <stringProp name="SoapSampler.SOAP_ACTION">urn:riv:insuranceprocess:healthreporting:GetCertificateResponder:1:GetCertificate</stringProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">true</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
        </SoapSampler>
        <hashTree/>
        <SoapSampler guiclass="SoapSamplerGui" testclass="SoapSampler" testname="GetCertificate-2" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="SoapSampler.URL_DATA">${HOST}/get-certificate/v1.0</stringProp>
          <stringProp name="HTTPSamper.xml_data">&lt;soap:Envelope xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;&lt;soap:Header&gt;&lt;ns4:To xmlns:ns4=&quot;http://www.w3.org/2005/08/addressing&quot; xmlns:ns3=&quot;urn:riv:insuranceprocess:healthreporting:2&quot; xmlns:ns2=&quot;urn:riv:insuranceprocess:certificate:1&quot; xmlns=&quot;urn:riv:insuranceprocess:healthreporting:GetCertificateResponder:1&quot;/&gt;&lt;/soap:Header&gt;&lt;soap:Body&gt;&lt;GetCertificateRequest xmlns=&quot;urn:riv:insuranceprocess:healthreporting:GetCertificateResponder:1&quot; xmlns:ns2=&quot;urn:riv:insuranceprocess:certificate:1&quot; xmlns:ns3=&quot;urn:riv:insuranceprocess:healthreporting:2&quot; xmlns:ns4=&quot;http://www.w3.org/2005/08/addressing&quot;&gt;&lt;certificateId&gt;intyg-2&lt;/certificateId&gt;&lt;nationalIdentityNumber&gt;19121212-1212&lt;/nationalIdentityNumber&gt;&lt;/GetCertificateRequest&gt;&lt;/soap:Body&gt;&lt;/soap:Envelope&gt;</stringProp>
          <stringProp name="SoapSampler.xml_data_file"></stringProp>
          <stringProp name="SoapSampler.SOAP_ACTION">urn:riv:insuranceprocess:healthreporting:GetCertificateResponder:1:GetCertificate</stringProp>
          <stringProp name="SoapSampler.SEND_SOAP_ACTION">true</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
        </SoapSampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <objProp>
          <name>saveConfig</name>
          <value class="SampleSaveConfiguration">
            <time>true</time>
            <latency>true</latency>
            <timestamp>true</timestamp>
            <success>true</success>
            <label>true</label>
            <code>true</code>
            <message>true</message>
            <threadName>true</threadName>
            <dataType>true</dataType>
            <encoding>false</encoding>
            <assertions>true</assertions>
            <subresults>true</subresults>
            <responseData>false</responseData>
            <samplerData>false</samplerData>
            <xml>false</xml>
            <fieldNames>false</fieldNames>
            <responseHeaders>false</responseHeaders>
            <requestHeaders>false</requestHeaders>
            <responseDataOnError>false</responseDataOnError>
            <saveAssertionResultsFailureMessage>false</saveAssertionResultsFailureMessage>
            <assertionsResultsToSave>0</assertionsResultsToSave>
            <bytes>true</bytes>
          </value>
        </objProp>
        <stringProp name="filename"></stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>
