web/src/test/resources/integrationtests/listcertificates/requests.stg

delimiters "$", "$"

request(personId) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:insuranceprocess:healthreporting:ListCertificatesResponder:1">
   <soapenv:Header>
      <add:To>1</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:ListCertificatesRequest>
         <urn:nationalIdentityNumber>$personId$</urn:nationalIdentityNumber>
      </urn:ListCertificatesRequest>
   </soapenv:Body>
</soapenv:Envelope>
>>

requestCertificateType(personId, certificateType) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:insuranceprocess:healthreporting:ListCertificatesResponder:1">
   <soapenv:Header>
      <add:To>1</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:ListCertificatesRequest>
         <urn:nationalIdentityNumber>$personId$</urn:nationalIdentityNumber>
         <urn:certificateType>$certificateType$</urn:certificateType>
      </urn:ListCertificatesRequest>
   </soapenv:Body>
</soapenv:Envelope>
>>

requestDateInterval(personId, fromDate, toDate) ::= <<
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:urn="urn:riv:insuranceprocess:healthreporting:ListCertificatesResponder:1">
   <soapenv:Header>
      <add:To>1</add:To>
   </soapenv:Header>
   <soapenv:Body>
      <urn:ListCertificatesRequest>
         <urn:nationalIdentityNumber>$personId$</urn:nationalIdentityNumber>
         <urn:fromDate>$toDate$</urn:fromDate>
         <urn:toDate>$fromDate$</urn:toDate>
      </urn:ListCertificatesRequest>
   </soapenv:Body>
</soapenv:Envelope>
>>
